{
  "books": [
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Herkes İçin Kısa Osmanlı Tarihi",
      "description": "\n\nHERKES İÇİN KISA OSMANLI TARİHİ Kısa Özet\n\nOsmanlı İmparatorluğu, tarihin gördüğü en büyük imparatorluklardan birisiydi. 16. yüzyılda dünya siyasetine yön vererek, bugünkü dünyanın siyasi ve dini yapısının oluşmasına büyük katkıda bulundu. Osmanlı İmparatorluğu, tarih sahnesinden çekilmesine rağmen hâlâ izleri duruyor. Ancak hayatımızın hemen hemen her safhasında izleriyle karşılaşmamıza rağmen Osmanlı tarihi özellikle akademik dünyanın dışındaki okurlar için hâlâ karanlıklar içerisinde.\n\nSon 50-60 yılda bütün dünyada Osmanlı tarih yazıcılığı büyük aşama kaydetmesine rağmen, akademik araştırmalarda ortaya çıkan sonuçlar ülkemizde kamuoyuna fazla ulaşamadı. Bu kitapta Osmanlı tarihi ana hatlarıyla anlatılırken akademik araştırmaların sonucunda ortaya çıkan bilgilerden hareket edilmiş, ancak konular anlaşılır bir üslupla verilmeye çalışılmıştır.",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0001704992001-1.jpg",
      "publisher": "Yeditepe Yayınevi",
      "author": "Erhan Afyoncu",
      "price": "120",
      "categoryId": 1,
      "publicationDate": "2024-02-02",
      "pageNumber": "288",
      "id": 1
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Fantastik Harry Potter Canavarlar Rehberi - Unoffical",
      "description": "SİHİRLİ BİR SAFARİYE ATILIN\n\n 150’den fazla canavar, varlık ve ikisinin arasındaki her şeyden oluşan sarsıcı bir çeşit yelpazesine sahip Unofficial Harry Potter Fantastik Canavarlar Rehberi, Harry Potter serisinin yanı sıra Fantastik Canavarlar filmleri de dâhil olmak üzere büyücü dünyası evreninden bilinen her yaratığı sunar. Bilgiç Mıncıklar, yardımsever ev cinleri, baykuş serpintisi, Akromantula, Kabuluklar ve diğer sihirli yaratıklarla dopdolu olan bu başlık, her yaratığın büyüklüğü, rengi ve alışkanlıkları, buna ek olarak Harry’nin ve Newt Scamander’ın hikâyelerinde nerede rastladığımız da dâhil olmak üzere benzersiz özelliklerini vurguluyor ve bir sonraki dolunaya kadar hayranlarını meşgul etmeyi garanti eden büyücülük dünyası ilmiyle ilgili sihirli bilgiler içeriyor.\n\n \n\nİÇİNDE\n\nPATRONUS BÜYÜLERİ VE ÇEŞİTLİ BİÇİMLERİ\n\n \n\nBİLİNEN VE TESCİL EDİLMEMİŞ ANİMAGİ\n\n \n\nSİHİRLİ HAYVAN ŞEKERLEMELERİ REHBERİ\n\n \n\nVE DAHA FAZLASI VAR !\n\n \n\nMUGGLENET HAKKINDA\n\n \n\nJ.K. Rowling’in bizzat kendisi tarafından “Aziz MuggleNet” olarak adlandırılan site, 1999’dan beri büyücülük dünyasının 1 numaralı kaynağıdır. Her ay bütün kanallardan 100 milyondan fazla okuyucu bu siteye ulaşmaya devam etmektedir. \n\n“Büyükbabamın başyapıtını Uzatma Tılsımından daha iyi genişletiyor.”\n\n-Gelecek Postası için çalışan belli bir Büyüzolog Başdanışmanı\n\n \n\n“Çok iyi araştırılmış, gözünüzden yaş getirecek bir kitap.”\n\n-görmüş geçirmiş bir Sihirli Yaratıkların Bakımı profesörü\n\n \n\n(Tanıtım Bülteninden)",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0002019117001-1.jpg",
      "publisher": "Martı Yayınları",
      "author": "Kolektif",
      "price": "148",
      "categoryId": 1,
      "publicationDate": "2022-02-02",
      "pageNumber": "217",
      "id": 2
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Nutuk - Gençler İçin Fotoğraflarla",
      "description": "Nutuk - Gençler İçin Fotoğraflarla Kitap Açıklaması\n\nKurtuluş Savaşı'nın önderi, Türkiye Cumhuriyeti'nin kurucusu Gazi Mustafa Kemal Atatürk'ün kaleme aldığı Nutuk, 19 Mayıs 1919'da, Mustafa Kemal Bandırma vapuru ile Samsun'a çıktığında ülkenin genel durumunu değerlendirmesiyle başlıyor. Türkiye Cumhuriyeti'nin küllerinden yeniden doğuş hikâyesini merak eden genç yaşlı herkese hitap eden kitap, araştırma-tarih türünde yayımlanıyor. Tarihin tozlu sayfalarına yolculuğa çıkacağınız Nutuk - Gençler İçin Fotoğraflarla eserinde daha neler bulacağınızdan kısaca bahsedelim.\n\n \n\n\"Nutuk - Gençler İçin Fotoğraflarla\" adlı kitabı neden okumalısınız?\n\n\"1919 yılı Mayıs'ın 19'ncu günü Samsun'a çıktım.\" cümlesiyle başlayan Nutuk, 1. Dünya Savaşı'nda mağlup olan Osmanlı Devleti'nin imzaladığı Mondros Ateşkes Antlaşması sonrası ülkenin genel durumunu, Samsun'a çıkış ve sonrasında gerçekleşen kongreleri, Türkiye Büyük Millet Meclisi'nin açılışını, Kurtuluş Savaşı'nın hazırlıklarını ve tüm savaşları, Lozan'a giden yolu, Cumhuriyet'in ilanını sonrasında peşi sıra gelen devrimleri içeriyor ve gençliğe hitabe ile sona eriyor. 600 sayfadan oluşan kitapta anlatılan olaylar belgelerle desteklenmiş ve kronolojik bir sırayla ilerliyor. Nutuk'un orijinalinin dili, yazıldığı dönem nedeniyle oldukça ağır ancak bu versiyonunda dili oldukça sadeleştirilerek yayımlanıyor. Bu sayede akıcı bir şekilde okuyabiliyorsunuz. Yeni Türkiye Cumhuriyeti'nin tarih sahnesinde yeniden varoluş hikâyesini birinci ağızdan okuma şansını elde etmek için Gazi Mustafa Kemal Atatürk'ün Nutuk - Gençler İçin Fotoğraflarla kitabını okumalısınız.\n\n \n\nBunları biliyor muydunuz?\n\nGazi Mustafa Kemal Atatürk, 1927 yazını Nutuk eserini yazmaya ayırır. Ankara'da başladığı yazım süreci, aralıksız 32 saati bulur. İçeriği kaleme alan yaverler Gazi Mustafa Kemal Atatürk'e ayak uydurabilmek için 8 saatte 1 değişir. Bu yoğun tempo sonucu Gazi Mustafa Kemal Atatürk kalp rahatsızlığı geçirir ve bir süre çalışmalarına ara verir. 1927 Haziran sonu ve Eylül sonu çalışmalarını İstanbul'da sürdürür ve Nutuk'un yazım sürecini tamamlar. Nutuk ilk defa 15 Ekim 1927'de Cumhuriyet Halk Fırkasının İkinci Büyük Kurultayında Gazi Mustafa Kemal Atatürk tarafından okunmaya başlanır. Okunması 6 günde, toplam 36 saat 33 dakikada tamamlanır. Nutuk, o kadar ilgi görür ki ilk okunduğu yıllarda Almanca, Fransızca ve İngilizce; sonrasında Rusça, Farsça, Kazakça, Türkmence, Yunanca baskıları yapılır. Gazi Mustafa Kemal Atatürk'ün Nutuk eseri, Türkiye İş Bankası Kültür Yayınları tarafından özellikle gençler için fotoğraflarla zenginleştirilerek 2010 yılında okuyuculara sunulur.\n\n \n\nBu kitabı sevenler için diğer önerilerimiz\n\nGazi Mustafa Kemal Atatürk'ün Nutuk - Gençler İçin Fotoğraflarla eserini okuduktan sonra, Turgut Özakman'ın Şu Çılgın Türkler'ini, Cumhuriyet Türk Mucizesi'ni, Cumhuriyet - Türk Mucizesi 2'sini, Halil İnalcık'ın Millî Mücadele Tarihi 1908 - 1923'ünü ve İmparatorluktan Cumhuriyete'sini de okumanızı öneririz.",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000325204-1.jpg",
      "publisher": "İş Bankası Kültür Yayınları - Tarih Dizisi",
      "author": "Mustafa Kemal Atatürk",
      "price": "54",
      "publicationDate": "2010-02-02",
      "categoryId": 1,
      "pageNumber": "176",
      "id": 3
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Küçük Prens",
      "description": "Küçük Prens Kitap Açıklaması\n\nKitapta yaşamın bilinmezliği, heyecanı, sevgisi, yalnızlığı, kavuşma özlemi ve hayatın yalın gerçekleri anlatılmaktadır. Öte yandan yetişkinlerin çoğu kez çocuksu bakış açısını yitirdiği ve çocuklara karşı yaptıkları hatalar büyük bir ustalıkla işlemiştir. Çoğu kez gözlerin gerçeği göremediği, kalp ile aramanın mesajı yer almaktadır… Çocukların ilgi ve beğeniyle okuduğu bu eserin yanında, onların yazma yeteneğini geliştirmek amacıyla Küçük Prens Günlük Defteri kitapla birlikte verilmektedir. Bu defterle; Çocuğun kendisiyle yüzleşmesinin yanında, kendini tanıma cesaretini göstererek yazmaya başlamasını sağlayacak ve yazın hayatına merhaba demiş olacaktır…\n\n\n\n\n(Tanıtım Bülteninden)",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0001696896001-1.jpg",
      "publisher": "Özlem Yayınevi",
      "author": "Antoine de Saint-Exupery",
      "price": "48",
      "publicationDate": "2017-11-01",
      "categoryId": 1,
      "pageNumber": "112",
      "id": 4
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Marslı",
      "description": "Marslı Kitap Açıklaması\n\nKızıl Gezegen Mars’ta soluk kesen bir maceraya ne dersiniz? Andy Weir sizi Mars’ın en bilinmeyenlerini birlikte keşfetmeye davet ediyor. Bir astronotun Mars gezegeninde yaşadıklarına odaklanan Marslı, okuyucuya heyecan ve gizem dolu bir yolculuk vadediyor. Gelin, Weir’ın bilim kurgu türüne kazandırdığı başyapıt niteliğindeki bu eseri daha yakından inceleyelim.\n\n\"Marslı\" adlı kitabı neden okumalısınız?\n\nAndy Weir’in kurgu yeteneğini gözler önüne serdiği Marslı romanı 2035 yılında geçiyor. Romanın hikâyesi ise Mars'ta mahsur kalan Amerikalı astronot Mark Watney'i takip ediyor. Bu, Watney’nin Mars'taki üçüncü görevi. İlk iki görevi sorunsuz geçen Watney, üçüncü seferinde başına geleceklerden habersiz. Mark Mars'ta çıkan bir fırtınada ağır yaralanıyor, astronot ekibinin geri kalanı onunla iletişim kurmak için çabalıyor. Mark’a hiçbir şekilde ulaşamayan keşif ekibi onun öldüğüne inandığından Mars’tan ayrılmak durumunda kalıyor. Mark uyandığında gezegendeki tek insanın kendisi olduğunu keşfediyor ve hayatta kalabilmek için stratejiler geliştirmeye çalışıyor. Peki, Mark hayatta kalmayı başarabilecek mi? Ne kadar süre bu durumu sürdürebilecek? Eğer siz de bu soruların cevabını merak ediyorsanız Marslı'da sorularınızdan çok daha fazlasını bulabilirsiniz. Andy Weir’ın fütürist üslubu okuyucuya dönemi tam anlamıyla yaşatıyor. Mizah unsurunu da romanından eksik etmeyen yazar, okuyucuya hem gerilim dolu hem eğlenceli bir okuma deneyimi vadediyor. Weir’ın usta kalemi sayesinde romanın baş kahramanı olan Mark’ı içselleştirmemek neredeyse imkânsız hâle geliyor. Sayfalar geçtikçe kendinizi onun yerine koyup böyle bir durumda neler yapabileceğinizi düşünürken buluyorsunuz. Marslı, özellikle bilim kurgu türünde kaleme alınan romanları tercih edenlerin elinden bırakmakta zorlanacağı bir eser.\n\nBunları biliyor muydunuz?\n\nAndy Weir’ın Marslı’yı ilk olarak kendi blogunda seri hâlinde yayınladığını duymuş muydunuz? 2014 yılında, Crown Publishing Group'un özel yayın haklarını satın almasının ardından kitap yeniden yayımlanır. Marslı yayımlandığı yıl New York Times En Çok Satanlar listesine girer ve uzun bir süre bu listede kalır. Weir, Marslı’yı yazmaya 2009 yılında mümkün olduğu kadar gerçekçi ve mevcut teknolojiye dayalı olması için ilgili materyalleri araştırarak başlar. Eleştirmenlerden ve okuyucudan olumlu değerlendirmeler alan Marslı pek çok ödüle layık görülür. 45'ten fazla dile çevrilen roman aynı isimle 2015 yılında beyaz perdeye (IMDb: 8.0/10) uyarlanır. Dilerseniz romanı okuduktan sonra bu başarılı uyarlamayı izleyerek romanı görsel olarak da değerlendirebilirsiniz.\n\nBu kitabı sevenler için diğer önerilerimiz\n\nAndy Weir’ın tarzını beğendiyseniz Kurtuluş Projesi ve Artemis isimli kitaplarını inceleyebilirsiniz. Benzer türde kaleme alınan Bir Mars Destanı, Mars Yıllıkları, Karanlığın Sol Eli ve Otostopçunun Galaksi Rehberi - 5 Kitap Bir Arada'ya da göz atabilirsiniz.",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0000000625238-1.jpg",
      "publisher": "İthaki Yayınları",
      "author": "Andy Weir",
      "price": "245",
      "publicationDate": "2014-01-01",
      "categoryId": 4,
      "pageNumber": "416",
      "id": 5
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Zan - Bir Arifin Fantastik Romanı",
      "description": "Zan - Bir Arifin Fantastik Romanı Kitap Açıklaması\n\nBizimki gibi efsanelere tanıklık etmiş bir coğrafyadan, neden dünyaya meydan okuyabilecek bir fantastik eser çıkmadı diye düşündünüz mü hiç? Oysa yazılanların büyük bir bölümü yaşadığımız diyardan derlenmiş ve bizim inançlarımızdan esin almıştır. Ben, bu topraklarda doğmuş, büyümüş birisi olarak fantastik bizim işimizdir demek istiyorum. Gelin hep birlikte hayal gücümüzün sınırlarını genişletecek bu macerada kendimizi bulalım. Süper güçlerin bugüne kadar ki yazılmış en muazzam hallerine tanıklık edelim.\n    \nTürkçe dilinde yazılmış ve basılmış ilk “Light Novel” niteliği taşıyan bu romanı, özellikle fantastik, anime ve bilimkurgu hayranlarına armağan ediyorum.  Öte yandan yıllarca kendi kendimi eğiterek edindiğim tasavvuf alanındaki fikirlerimi ve Tanrı’ya bakışımı da siz değerleri okuyucularımla paylaşmak istiyorum.\n\n(Tanıtım Bülteninden)",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0002017311001-1.jpg",
      "publisher": "Martı Yayınları",
      "author": "Fatih Şalvan",
      "price": "48",
      "categoryId": 5,
      "publicationDate": "2022-01-01",
      "pageNumber": "160",
      "id": 6
    },
    {
      "rentInformation": {
        "rent": false,
        "byWhom": null
      },
      "title": "Hançer-i Süleyman: Fantastik Tarihi Roman",
      "description": "Hançer-i Süleyman: Fantastik Tarihi Roman Kitap Açıklaması\n\nSırp diyarının merkezi Belgrad daha önce eşi benzeri görülmemiş hadiselere ev sahipliği yapıyordu. Köy, kasaba ve tüm nahiyelerde birkaç hafta arayla eş zamanlı olarak ilginç cesetler görülmeye başlanmıştı.\n\nBelgrad ilinde bu ölümlerden sonra peyda olan Papaz Geron ve peşine taktığı adamları -cadı avcıları- yeni ölümlerin olmaması, genç kızların kurtarılması için başlattıkları operasyon ve onların yaydığı “Tüm bu olanların sebebi Türklerdir.” dedikodusu kısa sürede iki tarafı da karşı karşıya getirdiği gibi yeni ölümlerin de habercisi olmuştu.  Karın yeni kalkmasından sonra ortaya çıkan bu olaylar en çok sınır gazisi Karaca Bey’in dikkatini çekmişti.\nYaşanan ölümler üzerine çıkan kargaşadan “cadı” ve “vampir” kavramları doğmuş diyar diyar yayılmıştır. Nice ölümlere sebep olan bu dedikodular gittikçe büyümekteydi, sonunun nereye varacağını kimse bilmiyordu.\n“Cazûlar’’ serisinin ilk kitabı olan “Hançer-i Süleyman” sizleri eşsiz bir maceraya davet ediyor.\n\n \n\n(Tanıtım Bülteninden)",
      "imageUrl": "https://i.dr.com.tr/cache/500x400-0/originals/0001905321001-1.jpg",
      "publisher": "Otantik Kitap",
      "author": "Furkan Çırak",
      "price": "69",
      "publicationDate": "2021-01-01",
      "categoryId": 5,
      "pageNumber": "256",
      "id": 7
    }
  ],
  "categories": [
    {
      "id": 1,
      "title": "Roman",
      "description": "Roman türündeki kitaplar."
    },
    {
      "id": 2,
      "title": "Bilim Kurgu",
      "description": "Bilim kurgu türündeki kitaplar."
    },
    {
      "id": 3,
      "title": "Polisiye",
      "description": "Polisiye türündeki kitaplar."
    },
    {
      "id": 4,
      "title": "Fantastik",
      "description": "Fantastik türündeki kitaplar."
    },
    {
      "id": 5,
      "title": "Tarih",
      "description": "Tarih kitapları."
    },
    {
      "id": 6,
      "title": "Biyografi",
      "description": "Biyografi kitapları."
    },
    {
      "id": 7,
      "title": "Edebiyat",
      "description": "Edebiyat eserleri."
    },
    {
      "id": 8,
      "title": "Felsefe",
      "description": "Felsefi eserler."
    },
    {
      "id": 9,
      "title": "Dini",
      "description": "Dini eserler."
    },
    {
      "id": 10,
      "title": "Korku",
      "description": "Korku türündeki kitaplar."
    },
    {
      "id": 11,
      "title": "Çocuk",
      "description": "Çocuk kitapları."
    },
    {
      "id": 12,
      "title": "Klasik",
      "description": "Klasik eserler."
    },
    {
      "id": 13,
      "title": "Kültür",
      "description": "Kültürel eserler."
    },
    {
      "id": 14,
      "title": "Sanat",
      "description": "Sanat kitapları."
    },
    {
      "title": "Müzik",
      "description": "Müzik kitapları.",
      "id": 15
    }
  ],
  "adminUsers": [
    {
      "firstName": "Serhan",
      "lastName": "Bakır",
      "email": "serhanbakir5@gmail.com",
      "password": "Serhan342.",
      "accountDate": "21-2-2024",
      "banned": false,
      "id": 1
    }
  ],
  "webUsers": [
    {
      "firstName": "Serhan",
      "lastName": "Bakır",
      "email": "serhanbakir5@gmail.com",
      "password": "Serhan342.",
      "banned": false,
      "accountDate": "22-2-2024",
      "id": 1
    }
  ]
}